In [10]:
import os
import pandas as pd
os.chdir("D:\\program\\PYTHON\\CSV")
x=pd.read_csv("csv1.csv")
print(x)

   Rollno   Name Gender  Age
0      18   Ajay   Male   20
1      19  Shiva   Male   21
2      20    Ram   Male   20

In [11]:
# crosstab() in pandas used to give the frequency

pd.crosstab(index=x["Gender"],columns="Name",dropna=True)

col_0   Name
Gender
Male       3

In [12]:
pd.crosstab(index=x["Age"],columns="Gender",dropna=True)

col_0  Gender
Age
20          2
21          1

In [14]:
#normalize will give you the propability
pd.crosstab(index=x["Age"],columns="Gender",dropna=True,normalize=True)

col_0    Gender
Age
20     0.666667
21     0.333333

In [17]:
#by margin=True you will get column wise and row wise sum

pd.crosstab(index=x["Age"],columns="Gender",dropna=True,normalize=True,margins=True)

col_0    Gender       All
Age
20     0.666667  0.666667
21     0.333333  0.333333
All    1.000000  1.000000

In [20]:
pd.crosstab(index=x["Age"],columns="Gender",dropna=True,normalize="index",margins=True)

col_0  Gender
Age
20        1.0
21        1.0
All       1.0

In [22]:
pd.crosstab(index=x["Age"],columns="Gender",dropna=True,normalize="columns",margins=True)

col_0    Gender       All
Age
20     0.666667  0.666667
21     0.333333  0.333333